# reading CSV

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('students_index_False.csv')

In [3]:
df

          usn     name  sem  ia1  ia2  ia3       avg
0  2ka19cs032    pavan    5  156  167  180  167.6670
1  2ka19cs033    pooja    5  165  164  134  154.3330
2  2ka19cs034   prasad    5  112  121  142  125.0000
3  2ka19cs035   pratap    5  167  134  164  155.0000
4  2ka19cs036  pruthvi    5  145  119  113  125.6667

In [4]:
df.head(2)

          usn   name  sem  ia1  ia2  ia3      avg
0  2ka19cs032  pavan    5  156  167  180  167.667
1  2ka19cs033  pooja    5  165  164  134  154.333

In [5]:
df.tail(2)

          usn     name  sem  ia1  ia2  ia3       avg
3  2ka19cs035   pratap    5  167  134  164  155.0000
4  2ka19cs036  pruthvi    5  145  119  113  125.6667

In [6]:
df.describe()  #describes only numerical values in dataframe

       sem         ia1         ia2       ia3         avg
count  5.0    5.000000    5.000000    5.0000    5.000000
mean   5.0  149.000000  141.000000  146.6000  145.533340
std    0.0   22.438806   23.119256   26.1113   19.191483
min    5.0  112.000000  119.000000  113.0000  125.000000
25%    5.0  145.000000  121.000000  134.0000  125.666700
50%    5.0  156.000000  134.000000  142.0000  154.333000
75%    5.0  165.000000  164.000000  164.0000  155.000000
max    5.0  167.000000  167.000000  180.0000  167.667000

In [7]:
df.count()

usn     5
name    5
sem     5
ia1     5
ia2     5
ia3     5
avg     5
dtype: int64

In [8]:
for i in df:
    print(i)

usn
name
sem
ia1
ia2
ia3
avg

In [9]:
df.dtypes

usn      object
name     object
sem       int64
ia1       int64
ia2       int64
ia3       int64
avg     float64
dtype: object

In [10]:
df

          usn     name  sem  ia1  ia2  ia3       avg
0  2ka19cs032    pavan    5  156  167  180  167.6670
1  2ka19cs033    pooja    5  165  164  134  154.3330
2  2ka19cs034   prasad    5  112  121  142  125.0000
3  2ka19cs035   pratap    5  167  134  164  155.0000
4  2ka19cs036  pruthvi    5  145  119  113  125.6667

In [11]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [12]:
df.columns

Index(['usn', 'name', 'sem', 'ia1', 'ia2', 'ia3', 'avg'], dtype='object')

In [13]:
df.to_numpy()

array([['2ka19cs032', 'pavan', 5, 156, 167, 180, 167.667],
       ['2ka19cs033', 'pooja', 5, 165, 164, 134, 154.333],
       ['2ka19cs034', 'prasad', 5, 112, 121, 142, 125.0],
       ['2ka19cs035', 'pratap', 5, 167, 134, 164, 155.0],
       ['2ka19cs036', 'pruthvi', 5, 145, 119, 113, 125.6667]],
      dtype=object)

In [14]:
df

          usn     name  sem  ia1  ia2  ia3       avg
0  2ka19cs032    pavan    5  156  167  180  167.6670
1  2ka19cs033    pooja    5  165  164  134  154.3330
2  2ka19cs034   prasad    5  112  121  142  125.0000
3  2ka19cs035   pratap    5  167  134  164  155.0000
4  2ka19cs036  pruthvi    5  145  119  113  125.6667

In [15]:
df.sort_index(axis=1)

        avg  ia1  ia2  ia3     name  sem         usn
0  167.6670  156  167  180    pavan    5  2ka19cs032
1  154.3330  165  164  134    pooja    5  2ka19cs033
2  125.0000  112  121  142   prasad    5  2ka19cs034
3  155.0000  167  134  164   pratap    5  2ka19cs035
4  125.6667  145  119  113  pruthvi    5  2ka19cs036

In [16]:
df.sort_index(axis=0)

          usn     name  sem  ia1  ia2  ia3       avg
0  2ka19cs032    pavan    5  156  167  180  167.6670
1  2ka19cs033    pooja    5  165  164  134  154.3330
2  2ka19cs034   prasad    5  112  121  142  125.0000
3  2ka19cs035   pratap    5  167  134  164  155.0000
4  2ka19cs036  pruthvi    5  145  119  113  125.6667

In [17]:
df.sort_index(axis=0, ascending =False)

          usn     name  sem  ia1  ia2  ia3       avg
4  2ka19cs036  pruthvi    5  145  119  113  125.6667
3  2ka19cs035   pratap    5  167  134  164  155.0000
2  2ka19cs034   prasad    5  112  121  142  125.0000
1  2ka19cs033    pooja    5  165  164  134  154.3330
0  2ka19cs032    pavan    5  156  167  180  167.6670

In [18]:
type(df)

pandas.core.frame.DataFrame

In [19]:
type(df['usn'])

pandas.core.series.Series

# COPY AND VIEW

In [20]:
newdf = df #this is not a way of copying dataframes into new one

In [21]:
newdf['sem'][0] = 4

C:\Users\pavan\AppData\Local\Temp/ipykernel_3104/1699598413.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf['sem'][0] = 4

In [22]:
df #changes made to newdf are also applied to df

          usn     name  sem  ia1  ia2  ia3       avg
0  2ka19cs032    pavan    4  156  167  180  167.6670
1  2ka19cs033    pooja    5  165  164  134  154.3330
2  2ka19cs034   prasad    5  112  121  142  125.0000
3  2ka19cs035   pratap    5  167  134  164  155.0000
4  2ka19cs036  pruthvi    5  145  119  113  125.6667

In [23]:
copydf = df.copy()

In [24]:
copydf['sem'][0] = 5

C:\Users\pavan\AppData\Local\Temp/ipykernel_3104/3216079878.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  copydf['sem'][0] = 5

In [25]:
df #df remained unchanged

          usn     name  sem  ia1  ia2  ia3       avg
0  2ka19cs032    pavan    4  156  167  180  167.6670
1  2ka19cs033    pooja    5  165  164  134  154.3330
2  2ka19cs034   prasad    5  112  121  142  125.0000
3  2ka19cs035   pratap    5  167  134  164  155.0000
4  2ka19cs036  pruthvi    5  145  119  113  125.6667

In [26]:
copydf

          usn     name  sem  ia1  ia2  ia3       avg
0  2ka19cs032    pavan    5  156  167  180  167.6670
1  2ka19cs033    pooja    5  165  164  134  154.3330
2  2ka19cs034   prasad    5  112  121  142  125.0000
3  2ka19cs035   pratap    5  167  134  164  155.0000
4  2ka19cs036  pruthvi    5  145  119  113  125.6667

# overcome SettingWithCopyWarning  using loc[]

In [27]:
df

          usn     name  sem  ia1  ia2  ia3       avg
0  2ka19cs032    pavan    4  156  167  180  167.6670
1  2ka19cs033    pooja    5  165  164  134  154.3330
2  2ka19cs034   prasad    5  112  121  142  125.0000
3  2ka19cs035   pratap    5  167  134  164  155.0000
4  2ka19cs036  pruthvi    5  145  119  113  125.6667

In [28]:
df.loc[0]

usn     2ka19cs032
name         pavan
sem              4
ia1            156
ia2            167
ia3            180
avg        167.667
Name: 0, dtype: object

In [29]:
df.loc[0,'sem'] = 5

In [30]:
df

          usn     name  sem  ia1  ia2  ia3       avg
0  2ka19cs032    pavan    5  156  167  180  167.6670
1  2ka19cs033    pooja    5  165  164  134  154.3330
2  2ka19cs034   prasad    5  112  121  142  125.0000
3  2ka19cs035   pratap    5  167  134  164  155.0000
4  2ka19cs036  pruthvi    5  145  119  113  125.6667

In [31]:
copydf

          usn     name  sem  ia1  ia2  ia3       avg
0  2ka19cs032    pavan    5  156  167  180  167.6670
1  2ka19cs033    pooja    5  165  164  134  154.3330
2  2ka19cs034   prasad    5  112  121  142  125.0000
3  2ka19cs035   pratap    5  167  134  164  155.0000
4  2ka19cs036  pruthvi    5  145  119  113  125.6667

In [32]:
copydf.drop(0)

          usn     name  sem  ia1  ia2  ia3       avg
1  2ka19cs033    pooja    5  165  164  134  154.3330
2  2ka19cs034   prasad    5  112  121  142  125.0000
3  2ka19cs035   pratap    5  167  134  164  155.0000
4  2ka19cs036  pruthvi    5  145  119  113  125.6667

In [33]:
copydf.drop('avg', axis=1)

          usn     name  sem  ia1  ia2  ia3
0  2ka19cs032    pavan    5  156  167  180
1  2ka19cs033    pooja    5  165  164  134
2  2ka19cs034   prasad    5  112  121  142
3  2ka19cs035   pratap    5  167  134  164
4  2ka19cs036  pruthvi    5  145  119  113

In [34]:
df

          usn     name  sem  ia1  ia2  ia3       avg
0  2ka19cs032    pavan    5  156  167  180  167.6670
1  2ka19cs033    pooja    5  165  164  134  154.3330
2  2ka19cs034   prasad    5  112  121  142  125.0000
3  2ka19cs035   pratap    5  167  134  164  155.0000
4  2ka19cs036  pruthvi    5  145  119  113  125.6667

In [35]:
df.loc[0:2]

          usn    name  sem  ia1  ia2  ia3      avg
0  2ka19cs032   pavan    5  156  167  180  167.667
1  2ka19cs033   pooja    5  165  164  134  154.333
2  2ka19cs034  prasad    5  112  121  142  125.000

In [36]:
df.loc[2:]

          usn     name  sem  ia1  ia2  ia3       avg
2  2ka19cs034   prasad    5  112  121  142  125.0000
3  2ka19cs035   pratap    5  167  134  164  155.0000
4  2ka19cs036  pruthvi    5  145  119  113  125.6667

In [37]:
df.loc[[0,1], ['usn', 'name']]

          usn   name
0  2ka19cs032  pavan
1  2ka19cs033  pooja

In [38]:
df.loc[[0,4,1], ['sem']]

   sem
0    5
4    5
1    5

# running queries

In [39]:
df.loc[(df['ia1']>100) & (df['avg']>150)]

          usn    name  sem  ia1  ia2  ia3      avg
0  2ka19cs032   pavan    5  156  167  180  167.667
1  2ka19cs033   pooja    5  165  164  134  154.333
3  2ka19cs035  pratap    5  167  134  164  155.000

In [40]:
df.loc[(df['usn']=='2ka19cs032')]

          usn   name  sem  ia1  ia2  ia3      avg
0  2ka19cs032  pavan    5  156  167  180  167.667

# indexing with iloc[]

In [41]:
#df.loc[0,0]  will give error

In [42]:
df.iloc[0,0]

'2ka19cs032'

In [43]:
df.iloc[0,1]

'pavan'

In [44]:
df.iloc[1,0]

'2ka19cs033'

In [45]:
df.iloc[1,1]

'pooja'

In [47]:
df.iloc[[0,1,], [0,1,2]]

          usn   name  sem
0  2ka19cs032  pavan    5
1  2ka19cs033  pooja    5